### Frontend Terraform Plan
#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

aws_s3_bucket.event_planr_frontend: Refreshing state... [id=event-planr-frontend]
aws_s3_bucket_ownership_controls.event_planr_frontend: Refreshing state... [id=event-planr-frontend]
aws_cloudfront_origin_access_control.event_planr_frontend: Refreshing state... [id=E2Q7DEHQ6JM904]
aws_s3_bucket_website_configuration.event_planr_frontend: Refreshing state... [id=event-planr-frontend]
aws_ssm_parameter.frontend_bucket: Refreshing state... [id=/production/event_planr/frontendBucket]
aws_cloudfront_distribution.event_planr_frontend: Refreshing state... [id=E3PUC9984KUEPE]
aws_s3_bucket_acl.event_planr_frontend: Refreshing state... [id=event-planr-frontend,private]
aws_s3_bucket_policy.event_planr_frontend: Refreshing state... [id=event-planr-frontend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloud_front_allow_access_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloud_front_allow_access_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::442019309462:distribution/E3PUC9984KUEPE",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.event_planr_frontend will be updated in-place
  ~ resource "aws_cloudfront_distribution" "event_planr_frontend" {
        id                             = "E3PUC9984KUEPE"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ target_origin_id       = "event_planr_frontend_origin" -> "production_event_planr_frontend_origin"
            # (10 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "event-planr-frontend.s3.us-east-1.amazonaws.com" -> null
          - origin_access_control_id = "E2Q7DEHQ6JM904" -> null
          - origin_id                = "event_planr_frontend_origin" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = "E2Q7DEHQ6JM904"
          + origin_id                = "production_event_planr_frontend_origin"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_control.event_planr_frontend will be updated in-place
  ~ resource "aws_cloudfront_origin_access_control" "event_planr_frontend" {
        id                                = "E2Q7DEHQ6JM904"
      ~ name                              = "event-planr-frontend" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.event_planr_frontend must be replaced
-/+ resource "aws_s3_bucket" "event_planr_frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::event-planr-frontend" -> (known after apply)
      ~ bucket                      = "event-planr-frontend" -> "production-event-planr-frontend" # forces replacement
      ~ bucket_domain_name          = "event-planr-frontend.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "event-planr-frontend.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "event-planr-frontend" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::442019309462:distribution/E3PUC9984KUEPE"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::event-planr-frontend/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "event-planr-frontend.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "1d21301b24a704e3233ffb5e4cb00785121fc9294fa5ac810b48bab381055b16" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_acl.event_planr_frontend must be replaced
-/+ resource "aws_s3_bucket_acl" "event_planr_frontend" {
      ~ bucket = "event-planr-frontend" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "event-planr-frontend,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "stedra99" -> null
                  - id           = "1d21301b24a704e3233ffb5e4cb00785121fc9294fa5ac810b48bab381055b16" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "stedra99" -> null
              - id           = "1d21301b24a704e3233ffb5e4cb00785121fc9294fa5ac810b48bab381055b16" -> null
            }
        }
    }

  # aws_s3_bucket_ownership_controls.event_planr_frontend must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "event_planr_frontend" {
      ~ bucket = "event-planr-frontend" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "event-planr-frontend" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.event_planr_frontend must be replaced
-/+ resource "aws_s3_bucket_policy" "event_planr_frontend" {
      ~ bucket = "event-planr-frontend" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "event-planr-frontend" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::442019309462:distribution/E3PUC9984KUEPE"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::event-planr-frontend/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_website_configuration.event_planr_frontend must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "event_planr_frontend" {
      ~ bucket           = "event-planr-frontend" -> "production-event-planr-frontend" # forces replacement
      ~ id               = "event-planr-frontend" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "event-planr-frontend.s3-website-us-east-1.amazonaws.com" -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.android_apk_url will be created
  + resource "aws_ssm_parameter" "android_apk_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/event_planr/androidApkUrl"
      + tags_all       = {
          + "environment" = "production"
          + "project"     = "event_planr"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.frontend_bucket will be updated in-place
  ~ resource "aws_ssm_parameter" "frontend_bucket" {
        id             = "/production/event_planr/frontendBucket"
      + insecure_value = (known after apply)
        name           = "/production/event_planr/frontendBucket"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Error</summary>

```terraform


```

</details>